apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_pflash.h
/* Platform Flash Memory Configuration Register 0 (PFCR0) */

#define PFLASH_PFCR0_P0_CBFEN             (1 << 0)  /* Bit 0: Port 0 PFLASH Line Read Code Buffers Enable (P0_CBFEN) */
#define PFLASH_PFCR0_P0_DBFEN             (1 << 1)  /* Bit 1: Port 0 PFLASH Line Read Data Buffers Enable (P0_DBFEN) */
                                                    /* Bit 2-3: Reserved */
#define PFLASH_PFCR0_P0_CPFEN             (1 << 4)  /* Bit 4: Port 0 Code Prefetch Enable (P0_CPFEN) */
#define PFLASH_PFCR0_P0_DPFEN             (1 << 5)  /* Bit 5: Port 0 Data Prefetch Enable (P0_DPFEN) */
                                                    /* Bits 6-31: Reserved */

/* Platform Flash Memory Configuration Register 1 (PFCR1) */

#define PFLASH_PFCR1_P1_CBFEN             (1 << 0)  /* Bit 0: Port 1 PFLASH Line Read Code Buffers Enable (P1_CBFEN) */
#define PFLASH_PFCR1_P1_DBFEN             (1 << 1)  /* Bit 1: Port 1 PFLASH Line Read Data Buffers Enable (P1_DBFEN) */
                                                    /* Bit 2-3: Reserved */
#define PFLASH_PFCR1_P1_CPFEN             (1 << 4)  /* Bit 4: Port 1 Code Prefetch Enable (P1_CPFEN) */
#define PFLASH_PFCR1_P1_DPFEN             (1 << 5)  /* Bit 5: Port 1 Data Prefetch Enable (P1_DPFEN) */
                                                    /* Bits 6-31: Reserved */

/* Platform Flash Memory Configuration Register 2 (PFCR2) */

#define PFLASH_PFCR2_P2_CBFEN             (1 << 0)  /* Bit 0: Port 2 PFLASH Line Read Code Buffers Enable (P2_CBFEN) */
#define PFLASH_PFCR2_P2_DBFEN             (1 << 1)  /* Bit 1: Port 2 PFLASH Line Read Data Buffers Enable (P2_DBFEN) */
                                                    /* Bit 2-3: Reserved */
#define PFLASH_PFCR2_P2_CPFEN             (1 << 4)  /* Bit 4: Port 2 Code Prefetch Enable (P2_CPFEN) */
#define PFLASH_PFCR2_P2_DPFEN             (1 << 5)  /* Bit 5: Port 2 Data Prefetch Enable (P2_DPFEN) */
                                                    /* Bits 6-31: Reserved */

/* Platform Flash Memory Configuration Register 4 (PFCR4) */

#define PFLASH_PFCR4_DERR_SUP             (1 << 0)  /* Bit 0: Data Error Suppression (DERR_SUP) */
#define PFLASH_PFCR4_BLK4_PS_SHIFT        (1)       /* Bits 1-3: Block 4 Pipe Select (BLK4_PS) */
#define PFLASH_PFCR4_BLK4_PS_MASK         (0x07 << PFLASH_PFCR4_BLK4_PS_SHIFT)
                                                    /* Bits 4-6: Reserved */
#define PFLASH_PFCR4_DMEEE                (1 << 7)  /* Bit 7: Disable Multi-Bit ECC Error Exception (DMEEE) */
                                                    /* Bits 8-31: Reserved */

/* Platform Flash Memory Access Protection Register (PFAPR) */

#define PFLASH_PFAPR_M15AP_SHIFT          (0)       /* Bits 0-1: Master 15 Access Protection (M15AP) */
#define PFLASH_PFAPR_M15AP_MASK           (0x03 << PFLASH_PFAPR_M15AP_SHIFT)
#define PFLASH_PFAPR_M14AP_SHIFT          (2)       /* Bits 2-3: Master 14 Access Protection (M14AP) */
#define PFLASH_PFAPR_M14AP_MASK           (0x03 << PFLASH_PFAPR_M14AP_SHIFT)
#define PFLASH_PFAPR_M13AP_SHIFT          (4)       /* Bits 4-5: Master 13 Access Protection (M13AP) */
#define PFLASH_PFAPR_M13AP_MASK           (0x03 << PFLASH_PFAPR_M13AP_SHIFT)
#define PFLASH_PFAPR_M12AP_SHIFT          (6)       /* Bits 6-7: Master 12 Access Protection (M12AP) */
#define PFLASH_PFAPR_M12AP_MASK           (0x03 << PFLASH_PFAPR_M12AP_SHIFT)
#define PFLASH_PFAPR_M11AP_SHIFT          (8)       /* Bits 8-9: Master 11 Access Protection (M11AP) */
#define PFLASH_PFAPR_M11AP_MASK           (0x03 << PFLASH_PFAPR_M11AP_SHIFT)
#define PFLASH_PFAPR_M10AP_SHIFT          (10)      /* Bits 10-11: Master 10 Access Protection (M10AP) */
#define PFLASH_PFAPR_M10AP_MASK           (0x03 << PFLASH_PFAPR_M10AP_SHIFT)
#define PFLASH_PFAPR_M9AP_SHIFT           (12)      /* Bits 12-13: Master 9 Access Protection (M9AP) */
#define PFLASH_PFAPR_M9AP_MASK            (0x03 << PFLASH_PFAPR_M9AP_SHIFT)
#define PFLASH_PFAPR_M8AP_SHIFT           (14)      /* Bits 14-15: Master 8 Access Protection (M8AP) */
#define PFLASH_PFAPR_M8AP_MASK            (0x03 << PFLASH_PFAPR_M8AP_SHIFT)
#define PFLASH_PFAPR_M7AP_SHIFT           (16)      /* Bits 16-17: Master 7 Access Protection (M7AP) */
#define PFLASH_PFAPR_M7AP_MASK            (0x03 << PFLASH_PFAPR_M7AP_SHIFT)
#define PFLASH_PFAPR_M6AP_SHIFT           (18)      /* Bits 18-19: Master 6 Access Protection (M6AP) */
#define PFLASH_PFAPR_M6AP_MASK            (0x03 << PFLASH_PFAPR_M6AP_SHIFT)
#define PFLASH_PFAPR_M5AP_SHIFT           (20)      /* Bits 20-21: Master 5 Access Protection (M5AP) */
#define PFLASH_PFAPR_M5AP_MASK            (0x03 << PFLASH_PFAPR_M5AP_SHIFT)
#define PFLASH_PFAPR_M4AP_SHIFT           (22)      /* Bits 22-23: Master 4 Access Protection (M4AP) */
#define PFLASH_PFAPR_M4AP_MASK            (0x03 << PFLASH_PFAPR_M4AP_SHIFT)
                                                    /* Bits 24-25: Reserved */
#define PFLASH_PFAPR_M2AP_SHIFT           (26)      /* Bits 26-27: Master 2 Access Protection (M2AP) */
#define PFLASH_PFAPR_M2AP_MASK            (0x03 << PFLASH_PFAPR_M2AP_SHIFT)
#define PFLASH_PFAPR_M1AP_SHIFT           (28)      /* Bits 28-29: Master 1 Access Protection (M1AP) */
#define PFLASH_PFAPR_M1AP_MASK            (0x03 << PFLASH_PFAPR_M1AP_SHIFT)
#define PFLASH_PFAPR_M0AP_SHIFT           (30)      /* Bits 30-31: Master 0 Access Protection (M0AP) */
#define PFLASH_PFAPR_M0AP_MASK            (0x03 << PFLASH_PFAPR_M0AP_SHIFT)

/* Platform Flash Memory Program Erase Address Logical (PFCPGM_PEADR_L) */

#define PFLASH_PFCPGM_PEADR_L_SHIFT       (0)       /* Bits 0-31: Program Erase Address Logical (PEADR_L) */
#define PFLASH_PFCPGM_PEADR_L_MASK        (0xffffffff << PFLASH_PFCPGM_PEADR_L_SHIFT)

/* Platform Flash Memory Program Erase Address Physical (PFCPGM_PEADR_P) */

#define PFLASH_PFCPGM_PEADR_P_SHIFT       (0)       /* Bits 0-31: Program Erase Address Physical (PEADR_P) */
#define PFLASH_PFCPGM_PEADR_P_MASK        (0xffffffff << PFLASH_PFCPGM_PEADR_P_SHIFT)

/* Platform Flash Memory Express Program Erase Address Logica
 * (PFCPGM_XPEADR_L)
 */

