apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_pflash.h
#define PFLASH_PFCPGM_XPEADR_L_SHIFT      (0)       /* Bits 0-31: Express Program Erase Address Logical (XPEADR_L) */
#define PFLASH_PFCPGM_XPEADR_L_MASK       (0xffffffff << PFLASH_PFCPGM_XPEADR_L_SHIFT)

/* Platform Flash Memory Express Program Erase Address Physical
 * (PFCPGM_XPEADR_P)
 */

#define PFLASH_PFCPGM_XPEADR_P_SHIFT      (0)       /* Bits 0-31: Express Program Erase Address Physical (XPEADR_P) */
#define PFLASH_PFCPGM_XPEADR_P_MASK       (0xffffffff << PFLASH_PFCPGM_XPEADR_P_SHIFT)

/* Block n Sector Program Erase Lock (PFCBLKn_SPELOCK) */

#define PFLASH_PFCBLK_SPELOCK_SHIFT       (0)       /* Bits 0-31: Sector Lock (SLCK) */
#define PFLASH_PFCBLK_SPELOCK_MASK        (0xffffffff << PFLASH_PFCBLK_SPELOCK_SLCK_SHIFT)

/* Block UTEST Sector Program Erase Lock (PFCBLKU_SPELOCK) */

#define PFLASH_PFCBLKU_SPELOCK_SLCK       (1 << 0)  /* Bit 0: Sector Lock (SLCK) */
                                                    /* Bits 1-31: Reserved */

/* Block n Super Sector Program Erase Lock (PFCBLKn_SSPELOCK) */

#define PFLASH_PFCBLK_SSPELOCK_SHIFT      (0)       /* Bits 0-11: Super Sector Lock (SSLCK) */
#define PFLASH_PFCBLK_SSPELOCK_MASK       (0x0fff << PFLASH_PFCBLK_SSPELOCK_SSLCK_SHIFT)
                                                    /* Bits 12-31: Reserved */

/* Block n Set Sector Lock (PFCBLKn_SETSLOCK) */

#define PFLASH_PFCBLK_SETSLOCK_SHIFT      (0)       /* Bits 0-31: Set Sector Lock (SETSLCK) */
#define PFLASH_PFCBLK_SETSLOCK_MASK       (0xffffffff << PFLASH_PFCBLK_SETSLOCK_SHIFT)

/* Block UTEST Set Sector Lock (PFCBLKU_SETSLOCK) */

#define PFLASH_PFCBLKU_SETSLOCK           (1 << 0)  /* Bit 0: Set Sector Lock (SETSLCK) */
                                                    /* Bits 1-31: Reserved */

/* Block n Set Super Sector Lock (PFCBLKn_SSETSLOCK) */

#define PFLASH_PFCBLK_SSETSLOCK_SHIFT     (0)       /* Bits 0-11: Set Super Sector Lock (SSETSLCK) */
#define PFLASH_PFCBLK_SSETSLOCK_MASK      (0x0fff << PFLASH_FCBLK_SSETSLOCK_SHIFT)
                                                    /* Bits 12-31: Reserved */

/* Block n Lock Master Sector m (PFCBLKn_LOCKMASTER_Sm) */

#define PFLASH_PFCBLK_LOCKMASTER_S_SHIFT  (0)       /* Bits 0-31: Block n Lock Master Sector m (LOCKMASTER_S) */
#define PFLASH_PFCBLK_LOCKMASTER_S_MASK   (0xffffffff << PFLASH_PFCBLK_LOCKMASTER_S_SHIFT)

/* Block UTEST Lock Master Sector (PFCBLKU_LOCKMASTER_S) */

#define PFLASH_PFCBLKU_LOCKMASTER_S_SHIFT (0)       /* Bits 0-7: Block n Lock Master Sector m (LOCKMASTER_S) */
#define PFLASH_PFCBLKU_LOCKMASTER_S_MASK  (0xff << PFLASH_PFCBLKU_LOCKMASTER_S_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Block n Lock Master Super Sector m (PFCBLKn_LOCKMASTER_SSm) */

#define PFLASH_PFCBLK_LOCKMASTER_SS_SHIFT (0)       /* Bits 0-31: Block n Lock Master Super Sector m (LOCKMASTER_SS) */
#define PFLASH_PFCBLK_LOCKMASTER_SS_MASK  (0xffffffff << PFLASH_PFCBLK_LOCKMASTER_SS_SHIFT)

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_PFLASH_H */
